{
  "game": {
    "name": "Shipbuilding",
    "description": "King Jellybean calls for building a ship. Therefore the king commands his servants to investigate the best shipbuilding techniques, tools and materials of all civilizations to create the best ship construction.",
    "players": [
      {
        "questIds": ["material", "connectors", "protection"]
      },
      {
        "questIds": ["ship-engine", "emergency", "food"]
      }
    ],
    "quests": {
      "material": {
        "name": "Material",
        "description": "Find the most stable material for shipbuilding",
        "items": [
          "pine",
          "oak",
          "teak"
        ]
      },
      "connectors": {
        "name": "Connectors",
        "description": "Find the best connection material for shipbuilding",
        "items": [
          "iron",
          "steel",
          "copper"
        ]
      },
      "protection": {
        "name": "Protection",
        "description": "Find the best protection against wear of friction",
        "items": [
          "hemp",
          "pine-tar",
          "resin"
        ]
      },
      "ship-engine": {
        "name": "Ship Engine",
        "description": "Find the best technique of propulsion",
        "items": [
          "linen-sailcloth",
          "cotton-sailcloth",
          "synthetic-fibers"
        ]
      },
      "emergency": {
        "name": "Emergency",
        "description": "Find the best technique of emergency propulsion",
        "items": [
          "paddle",
          "life-jacket",
          "life-raft"
        ]
      },
      "food": {
        "name": "Food",
        "description": "Find the best food for transit",
        "items": [
          "hardtack",
          "dried-meat",
          "alcohol",
          "fruits-and-vegetables"
        ]
      }
    },
    "items": {
      "pine": {
        "name": "Pine",
        "description": "Pines are among the most commercially important tree species valued for their timber and wood pulp throughout the world. In temperate and tropical regions, they are fast-growing softwoods that will grow in relatively dense stands, their acidic decaying needles inhibiting the sprouting of competing hardwoods."
      },
      "oak": {
        "name": "Oak",
        "description": "Oak wood has a density of about 0.75 g/cm3 (0.43 oz/cu in) creating great strength and hardness. The wood is very resistant to insect and fungal attack because of its high tannin content. Oak planking was common on high status Viking longships in the 9th and 10th centuries."
      },
      "teak": {
        "name": "Teak",
        "description": "Teak's high oil content, high tensile strength and tight grain make it particularly suitable where weather resistance is desired. It is used in the manufacture of outdoor furniture and boat decks."
      },
      "iron": {
        "name": "Iron",
        "description": "Iron nails with the pointed nail ends protruding on the inside of the boat, bent over and back into the wood in the form of a hook."
      },
      "steel": {
        "name": "Steel",
        "description": "Steel is an alloy of iron and other elements, primarily carbon. Because of its high tensile strength and low cost, it is a major component in buildings, infrastructure, tools, ships, automobiles, machines, appliances, and weapons."
      },
      "copper": {
        "name": "Copper",
        "description": "Copper has been used since ancient times as a durable, corrosion resistant, and weatherproof architectural material. Roofs, flashings, rain gutters, downspouts, domes, spires, vaults, and doors have been made from copper for hundreds or thousands of years."
      },
      "hemp": {
        "name": "Hemp",
        "description": "Hemp rope was used in the age of sailing ships, though the rope had to be protected by tarring, since hemp rope has a propensity for breaking from rot, as the capillary effect of the rope-woven fibers tended to hold liquid at the interior, while seeming dry from the outside."
      },
      "pine-tar": {
        "name": "Pine Tar",
        "description": "Pine tar can be used for preserving wooden boats (and other wood which will be exposed to the elements) by using a mixture of pine tar, gum turpentine and boiled linseed oil."
      },
      "resin": {
        "name": "Resin",
        "description": "Plant resins are valued for the production of varnishes, adhesives, and food glazing agents. They are also prized as raw materials for the synthesis of other organic compounds and provide constituents of incense and perfume."
      },
      "linen-sailcloth": {
        "name": "Linen Sailcloth",
        "description": "These natural fibers have poor resistance to rot, UV light and water absorption. Linen is stronger, but cotton is lighter. Linen was the traditional fiber of sails until it was supplanted by cotton during the 19th century"
      },
      "cotton-sailcloth": {
        "name": "Cotton Sailcloth",
        "description": "As sail size grew linen was too heavy to be practical so cotton became more popular. Cotton did not substantially replace linen worldwide until the end of the age of sail; however, in some cases the strength of linen was preferred for some types of sails."
      },
      "synthetic-fibers": {
        "name": "Synthetic Fibers",
        "description": "It was not until the late 20th century that natural fibers were replaced by synthetics in mainstream use."
      },
      "paddle": {
        "name": "Paddle",
        "description": "Aenean viverra tortor quis nisi commodo, id pellentesque magna interdum. Interdum et malesuada fames ac ante ipsum primis in faucibus."
      },
      "life-jacket": {
        "name": "Life jacket",
        "description": "Fusce aliquam, metus sed porta elementum, dolor urna ornare magna, eget aliquet sem elit ac nibh. Nullam malesuada nec orci commodo pulvinar."
      },
      "life-raft": {
        "name": "Life raft",
        "description": "Ut suscipit velit eget mauris tristique consectetur. Nullam rhoncus nec libero at efficitur."
      },
      "hardtack": {
        "name": "Hardtack",
        "description": "Hardtack is inexpensive and long-lasting. It is used for sustenance in the absence of perishable foods, commonly during long sea voyages, land migrations, and military campaigns."
      },
      "dried-meat": {
        "name": "Dried meat",
        "description": "Even in 1938, Eric Newby found the diet on the tall ship Moshulu to consist almost entirely of salted meat. Moshulu's lack of refrigeration left little choice as the ship made voyages which could exceed 100 days passage between ports."
      },
      "alcohol": {
        "name": "Alcohol",
        "description": "Alcohol has long been connected with life at sea."
      },
      "fruits-and-vegetables": {
        "name": "Fruits and vegetables",
        "description": "Fresh vegetables and citrus juice are the only substantial sources of vitamin C."
      }
    }
  }
}
